"""
Определить абсолютную погрешность следующих приближенных чисел по их относительным погрешностям δ.
а) а=13267,  δ=0,1%;
б) а=2,32,  δ=0,7%;
в) а=35,72,  δ=1%;
г) а=0,896,  δ=10%;
д) а=232,44,  δ=1%.
"""

def absolute_error(a, delta):
    return abs(a) * (delta / 100)


def three():
    data = [
        (13267, 0.1),
        (2.32, 0.7),
        (35.72, 1),
        (0.896, 10),
        (232.44, 1)
    ]

    print("Задание 3:")
    for a, delta in data:
        abs_error = absolute_error(a, delta)
        print(f"Для a = {a} и δ = {delta}%: Абсолютная погрешность = {abs_error:.5f}")
    print()
